simulationCHT/0/T
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 0 0 1 0 0 0 ];

internalField   uniform 300;

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"

    tube_inlet
    {
        type            fixedValue;
        value           $internalField;
    }
    shell_inlet
    {
        type            fixedValue;
        value           $internalField;  
    }
    shell_wall
    {
        type            zeroGradient;
    }
    tube_outlet
    {
        type            inletOutlet;
        value           $internalField;
    	inletValue	$internalField;
    }
    shell_outlet
    {
        type           	inletOutlet;
        value           $internalField;
        inletValue	$internalField;  
    }
}

// ************************************************************************* //
