simulationCHT/constant/tube_fluid/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/tube_fluid/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

3
(
    tube_inlet
    {
        type            patch;
        physicalType    patch;
        nFaces          14;
        startFace       774;
    }
    tube_outlet
    {
        type            patch;
        physicalType    patch;
        nFaces          14;
        startFace       788;
    }
    tube_fluid_to_shell_fluid
    {
        type            mappedWall;
        inGroups        List<word> 1(wall);
        nFaces          328;
        startFace       802;
        neighbourRegion shell_fluid;
        neighbourPatch  shell_fluid_to_tube_fluid;
        transformType   none;
    }
)

// ************************************************************************* //
